app/controllers/contas_controller.rb

  def index
    @receitas = Conta.find_all_by_tipo_conta('R')
---
SELECT * FROM "contas" WHERE ("contas"."tipo_conta" = 'R') LIMIT 1

  def show
    @conta = Conta.find(params[:id])
---
SELECT * FROM "contas" WHERE ("contas"."id" = 1)

  def edit
    @conta = Conta.find(params[:id])
---
SELECT * FROM "contas" WHERE ("contas"."id" = 2)

  def create
    @conta = Conta.new(params[:conta])
    data_valida = @conta.transformar_datas params[:conta][:data_pagamento], params[:conta][:data_vencimento]

    respond_to do |format|
      if data_valida && @conta.save
---
INSERT INTO "contas" ("data_vencimento", "created_at", "updated_at", "tipo_conta", "valor", "data_pagamento", "descricao") VALUES(NULL, '2010-04-16 12:07:17', '2010-04-16 12:07:17', 'D', 510.0, NULL, 'Salário do funcionário Eduardo Gade.')

  def update
    @conta = Conta.find(params[:id])
---
SELECT * FROM "contas" WHERE ("contas"."id" = 1)

  def destroy
    @conta = Conta.find(params[:id])
    @conta.destroy
---
SELECT * FROM "contas" WHERE ("contas"."id" = 1)
DELETE FROM "contas" WHERE "id" = 1