app/controllers/pacientes_controller.rb

SELECT * FROM "pacientes"
---
  def index
    @pacientes = Paciente.all

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 1)
---
  def show
    @paciente = Paciente.find(params[:id])

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 1)
---
  def edit
    @paciente = Paciente.find(params[:id])

INSERT INTO "enderecos" ("created_at", "cep", "updated_at", "bairro", "pessoa_id", "rua", "cidade", "estado") VALUES('2010-04-23 01:33:50', '53080300', '2010-04-23 01:33:50', 'Rio Doce', 5, 'Rua do Rouxinol', 'Olinda', NULL)
INSERT INTO "pacientes" ("created_at", "updated_at", "pessoa_id") VALUES('2010-04-23 00:52:01', '2010-04-23 00:52:01', NULL)
INSERT INTO "pessoas" ("created_at", "paciente_id", "nome", "cpf", "updated_at", "data_nascimento", "login", "sexo", "email", "senha") VALUES('2010-04-23 00:55:20', 1, 'paulo soares', '12', '2010-04-23 00:55:20', NULL, 'asasas', 'M', 'asasas', 'aaa')
INSERT INTO "telefones" ("is_celular", "telefone", "created_at", "updated_at", "pessoa_id", "codigo_area") VALUES(NULL, '12121212', '2010-04-23 21:36:49', '2010-04-23 21:36:49', 9, NULL)
---
  def create
    @paciente = Paciente.new(params[:paciente])
    data_valida = @paciente.pessoa.transformar_data params[:paciente][:pessoa_attributes][:data_nascimento]
    senha_valida = @paciente.pessoa.validar_senha params[:paciente][:pessoa_attributes][:senha], params[:paciente][:pessoa_attributes][:conf_senha]
    @paciente.pessoa.telefones[0].is_celular = false
    @paciente.pessoa.telefones[1].is_celular = true
    @paciente.pessoa.endereco.estado = params[:estado]


    respond_to do |format|
      if data_valida && senha_valida && @paciente.save

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 5)
UPDATE "pessoas" SET "updated_at" = '2010-04-23 01:43:02', "data_nascimento" = NULL WHERE "id" = 5
---
  def update
    @paciente = Paciente.find(params[:id])
    data_valida = @paciente.pessoa.transformar_data params[:paciente][:pessoa_attributes][:data_nascimento]

    respond_to do |format|
      if data_valida && senha_valida && @paciente.update_attributes(params[:paciente])

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 2)
DELETE FROM "pacientes" WHERE "id" = 2
---
  def destroy
    @paciente = Paciente.find(params[:id])
    @paciente.destroy